/*index.js*/
var util = require('../../utils/util.js');
Page({  
  data: {    
    newslist: [{ "author": "", "categoryId": 1330, "commentNumber": 169, "dateAdd": "2018-01-18 15:12:37", "dateUpdate": "2018-12-22 11:08:40", "descript": "房间门安装也是我们在房屋装修中不容忽视的一个问题。目前，市面上的房间门种类多样，其中免漆套装门无需涂刷油漆，安装简单，深受许多消费者的喜爱。那么免漆套装门有哪些优缺点，免漆套装门如何选购呢，下面本文就来给大家介绍下吧。免漆套装门优点 1、免漆套装门色彩丰富，具有天然木材纹理，外观精美，极具现代感。2、免漆套装门外表光滑细腻，无需涂抹油漆，不会对空气中散发有毒有害气体，环保性能出色。3、免漆套装门采用一次成型技术生产而成，施工周期比较读短，安装简单，安装完成即可入住。4、免漆套装门采用国外先进技术制作而成，选材上乘，抗冲击能力出色，具有防潮、防腐、防虫蛀、环保等优点。5、免漆套装门可根据用户的身、喜好与品位来变换各种造型，是许多人首选的木门种类。 免漆套装门缺点 质量较差的免漆套装门在用料一段时间过后，容易受到空气中的温度、湿度的影响，从而导致表面出现开胶变形的现象。 免漆套装门如何选购 1、门套的材质目前市面上有些免漆套装门的门套与门扇是采用不一样的材质制作的，这种免漆套装门通常质量较差，使用寿命较短，因此我们在购买时，最好咨询下门套与门扇的材料是否相同。2、掂量的办法 免漆套装门内部的填充物通常分为实心月部分实心，全部实心的填充物重量较重，价格也相对较高，而部分实心的重量较轻，价格相对便宜，因此我们在购买免漆套装门，可以掂下重量来判断木门的好坏。3、识别密封条 密封条的好坏直接影响木门的致密性，通常密封条就位于门套和门扇吊顶接触位置，摸上去相当柔软，通常大型木门品牌上面都会有安装密封条，避免我们关门后会出现裂缝。", "id": 2812, "income": "", "isRecommend": false, "keywords": "", "paixu": 0, "pic": "cloud://wxxc-5bc915.7778-wxxc-5bc915/tzm.jpg", "status": 2, "statusStr": "审核通过", "tags": "", "title": "免漆套装门优缺点 免漆套装门如何选购", "uid": 0, "unusefulNumber": 0, "usefulNumber": 0, "userId": 3387, "views": 37 }, { "author": "苑经理", "categoryId": 1330, "commentNumber": 169, "dateAdd": "2018-01-18 14:59:18", "dateUpdate": "2018-12-21 17:01:32", "descript": "家庭装修订做衣柜时，选择推拉门衣柜的消费者明显增加，很多取代传统平开门了。其中原因，主要是在结构稳定、使用方便、提高空间利用率、绿色环保、订做过程简便性、性价比等方面，推拉门衣柜都比传统平开门衣柜优越许多。", "id": 2811, "income": "", "isRecommend": false, "keywords": "", "paixu": 0, "pic": "cloud://wxxc-5bc915.7778-wxxc-5bc915/ygm.jpg", "status": 2, "statusStr": "审核通过", "tags": "", "title": "什么衣柜门最环保 如何选择衣柜门", "uid": 0, "unusefulNumber": 0, "usefulNumber": 0, "userId": 3387, "views": 22 }]
	}/*,
	onLoad: function(){
		var _this = this;
		// 案例列表获取
	    util.requestFun({
	      url: 'cms/news/list',
	      success: function(res){
	        _this.setData({
	          newslist : res.data.data
	        })
	      }
	    })
	}*/
})